STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.c
  /* De-initializes the Digital Filter for Sigma-Delta Modulators interface */
  if(AUDIO_OK != DFSDMx_DeInit())
  {
    return AUDIO_ERROR;
  }
  
  /* Initializes the Digital Filter for Sigma-Delta Modulators interface */
  if(AUDIO_OK != DFSDMx_Init(AudioFreq))
  {
    return AUDIO_ERROR;
  }
  
  return AUDIO_OK;
}

/**
  * @brief  Regular conversion complete callback. 
  * @note   In interrupt mode, user has to read conversion value in this function
            using HAL_DFSDM_FilterGetRegularValue.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t index;

  /* Stereo Channels treatment */
  if(audio_in_context.ChannelNbr == 2)
  {
    if(hdfsdm_filter == &haudio_in_dfsdm_leftfilter)
    {
      DmaLeftRecBuffCplt = 1;
    }
    else
    {
      DmaRightRecBuffCplt = 1;
    }

    if((DmaRightRecBuffCplt == 1) && (DmaLeftRecBuffCplt == 1))
    {
      if(AppBuffTrigger >= audio_in_context.RecSize)
        AppBuffTrigger = 0;

      for(index = (INTERNAL_BUFF_SIZE/2) ; index < INTERNAL_BUFF_SIZE; index++)
      {
        audio_in_context.pRecBuf[AppBuffTrigger]     = (uint16_t)(SaturaLH((LeftRecBuff[index] >> 8), -32760, 32760));
        audio_in_context.pRecBuf[AppBuffTrigger + 1] = (uint16_t)(SaturaLH((RightRecBuff[index] >> 8), -32760, 32760));
        AppBuffTrigger += 2;
      }
      DmaRightRecBuffCplt = DmaLeftRecBuffCplt = 0;
    }
  }
  else /* Mono Channel treatment */
  {
    for(index = (INTERNAL_BUFF_SIZE/2); index < INTERNAL_BUFF_SIZE; index++)
    {
      audio_in_context.pRecBuf[AppBuffTrigger]     = (uint16_t)(SaturaLH((LeftRecBuff[index] >> 8), -32760, 32760));
      AppBuffTrigger++;
    }
  }

  /* Update Trigger with Remaining Byte before callback if necessary */
  if(AppBuffTrigger >= audio_in_context.RecSize)
  {
    /* Reset Application Buffer Trigger */
    AppBuffTrigger = 0;
    AppBuffHalf = 0;
    
    /* Call the record update function to get the next buffer to fill and its size (size is ignored) */
    BSP_AUDIO_IN_TransferComplete_CallBack();
  }
  else if((AppBuffTrigger >= audio_in_context.RecSize/2))
  {
     if(AppBuffHalf == 0)
     {
        AppBuffHalf = 1;
        /* Manage the remaining file size and new address offset: This function 
           should be coded by user (its prototype is already declared in stm32l476g_eval_audio.h) */
        BSP_AUDIO_IN_HalfTransfer_CallBack();
     }
  }
}

/**
  * @brief  Half regular conversion complete callback. 
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t index;

  /* Stereo Channels treatment */
  if(audio_in_context.ChannelNbr == 2)
  {
    if(hdfsdm_filter == &haudio_in_dfsdm_leftfilter)
    {
      DmaLeftRecHalfBuffCplt = 1;
    }
    else
    {
      DmaRightRecHalfBuffCplt = 1;
    }

    if((DmaRightRecHalfBuffCplt == 1) && (DmaLeftRecHalfBuffCplt == 1))
    {
      if(AppBuffTrigger >= audio_in_context.RecSize)
        AppBuffTrigger = 0;

      for(index = 0; index < INTERNAL_BUFF_SIZE/2; index++)
      {
        audio_in_context.pRecBuf[AppBuffTrigger]     = (int16_t)(SaturaLH((LeftRecBuff[index] >> 8), -32760, 32760));
        audio_in_context.pRecBuf[AppBuffTrigger + 1] = (int16_t)(SaturaLH((RightRecBuff[index] >> 8), -32760, 32760));
        AppBuffTrigger += 2;
      }
      DmaRightRecHalfBuffCplt = DmaLeftRecHalfBuffCplt = 0;
    }
  }
  else /* Mono Channel treatment */
  {
    for(index = 0; index < (INTERNAL_BUFF_SIZE/2); index++)
    {
      audio_in_context.pRecBuf[AppBuffTrigger]     = (uint16_t)(SaturaLH((LeftRecBuff[index] >> 8), -32760, 32760));
      AppBuffTrigger++;
    }
  }

  /* Update Trigger with Remaining Byte before callback if necessary */
  if(AppBuffTrigger >= audio_in_context.RecSize)
  {
    /* Reset Application Buffer Trigger */
    AppBuffTrigger = 0;
    AppBuffHalf = 0;
    
    /* Call the record update function to get the next buffer to fill and its size (size is ignored) */
    BSP_AUDIO_IN_TransferComplete_CallBack();
  }
  else if((AppBuffTrigger >= audio_in_context.RecSize/2))
  {
     if(AppBuffHalf == 0)
     {
        AppBuffHalf = 1;
        /* Manage the remaining file size and new address offset: This function 
        should be coded by user (its prototype is already declared in stm32l476g_eval_audio.h) */
        BSP_AUDIO_IN_HalfTransfer_CallBack();
     }
  }
}

/**
  * @brief  Stops audio recording.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Stop(void)
{
  uint32_t ret = AUDIO_ERROR;
  
  AppBuffTrigger = 0;
  AppBuffHalf    = 0;
  
  if(audio_in_context.ChannelNbr == 2)
  {
    /* Call the Media layer stop function for right channel */
    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdm_rightfilter))
  {
    return ret;
  }
  }
  
  /* Call the Media layer stop function for left channel */
  if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdm_leftfilter))
  {
    return ret;
  }

  /* Return AUDIO_OK when all operations are correctly done */
  ret = AUDIO_OK;
  
  return ret;
}

/**
  * @brief  Pauses the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Pause(void)
{    
  if(audio_in_context.ChannelNbr == 2)
  {
  /* Call the Media layer stop function */
    if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdm_rightfilter))
  {
    return AUDIO_ERROR;
  }
  }
  
  /* Call the Media layer stop function */
  if(HAL_OK != HAL_DFSDM_FilterRegularStop_DMA(&haudio_in_dfsdm_leftfilter))
  {
    return AUDIO_ERROR;
  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Resumes the audio file stream.
  * @note   The Right channel is start a first with synchro on start Left channel
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Resume(void)
{    
  uint8_t ret = AUDIO_ERROR;
  
  if(audio_in_context.ChannelNbr == 2)
  {
    /* Call the Media layer start function for right channel */
    if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&haudio_in_dfsdm_rightfilter, (int32_t*)RightRecBuff, (audio_in_context.RecSize/DEFAULT_AUDIO_IN_CHANNEL_NBR)))
    {
      return ret;
    }
  }
  
  /* Call the Media layer start function for left channel */
  if(HAL_OK != HAL_DFSDM_FilterRegularStart_DMA(&haudio_in_dfsdm_leftfilter, (int32_t*)LeftRecBuff, (audio_in_context.RecSize/DEFAULT_AUDIO_IN_CHANNEL_NBR)))
  {
    return ret;
  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Controls the audio in volume level. 
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *         Mute and 100 for Max volume level).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  /* Set the Global variable AudioInVolume  */
  AudioInVolume = Volume; 
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  User callback when record buffer is filled.
  * @retval None
  */
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  /* This function should be implemented by the user application.
     It is called into this driver when the current buffer is filled
     to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Manages the DMA Half Transfer complete event.
  * @retval None
  */
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{ 
  /* This function should be implemented by the user application.
     It is called into this driver when the current buffer is filled
     to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Audio IN Error callback function.
  * @retval None
  */
__weak void BSP_AUDIO_IN_Error_Callback(void)
{   
  /* This function is called when an Interrupt due to transfer error on or peripheral
     error occurs. */
}

/**
  * @}
  */

/** @addtogroup STM32L476G_EVAL_AUDIO_Private_Functions
  * @{
  */

